vdm-dev/stm32playground/Projects_F407/Rfid522/rfid.c
//
// rfid.c based on MFRC522.cpp - Library to use ARDUINO RFID MODULE KIT 13.56 MHZ WITH TAGS SPI W AND R BY COOQROBOT.
// Based on code Dr.Leong   ( WWW.B2CQSHOP.COM )
// Created by Miguel Balboa (circuitito.com), Jan, 2012.
// Rewritten by Soren Thing Andersen (access.thing.dk), fall of 2013 (Translation to English, refactored, comments, anti collision, cascade levels.)
// Ported to mbed by Martin Olejar, Dec, 2013
// Ported to C for STM32F407VGT by Dmitry Lavygin (vdm.inbox@gmail.com), Dec, 2017
//


#include "rfid.h"

#include <string.h>

#include <stm32f4xx_rcc.h>
#include <stm32f4xx_gpio.h>
#include <stm32f4xx_spi.h>


static const char* const _TypeNamePICC[] =
{
  "Unknown type",
  "PICC compliant with ISO/IEC 14443-4",
  "PICC compliant with ISO/IEC 18092 (NFC)",
  "MIFARE Mini, 320 bytes",
  "MIFARE 1KB",
  "MIFARE 4KB",
  "MIFARE Ultralight or Ultralight C",
  "MIFARE Plus",
  "MIFARE TNP3XXX",

  /* not complete UID */
  "SAK indicates UID is not complete"
};

static const char* const _ErrorMessage[] =
{
  "Unknown error",
  "Success",
  "Error in communication",
  "Collision detected",
  "Timeout in communication",
  "A buffer is not big enough",
  "Internal error in the code, should not happen",
  "Invalid argument",
  "The CRC_A does not match",
  "A MIFARE PICC responded with NAK"
};

#define MFRC522_MaxPICCs (sizeof(_TypeNamePICC)/sizeof(_TypeNamePICC[0]))
#define MFRC522_MaxError (sizeof(_ErrorMessage)/sizeof(_ErrorMessage[0]))


void PCD_ConfigureSPI(void)
{
    // Clocks
    RFID_SPI_CLK_INIT(RFID_SPI_CLK, ENABLE);

    RCC_AHB1PeriphClockCmd(RFID_SCK_GPIO_CLK | RFID_MISO_GPIO_CLK | 
                           RFID_MOSI_GPIO_CLK | RFID_NSS_GPIO_CLK, ENABLE);
    
    
    // Ports
    GPIO_InitTypeDef port;

    port.GPIO_Mode = GPIO_Mode_AF;
    port.GPIO_OType = GPIO_OType_PP;
    port.GPIO_PuPd  = GPIO_PuPd_DOWN;
    port.GPIO_Speed = GPIO_High_Speed;

    // SCK
    port.GPIO_Pin = RFID_SCK_PIN;
    GPIO_Init(RFID_SCK_GPIO_PORT, &port);
    GPIO_PinAFConfig(RFID_SCK_GPIO_PORT, RFID_SCK_SOURCE, RFID_SCK_AF);

    // MISO
    port.GPIO_Pin =  RFID_MISO_PIN;
    GPIO_Init(RFID_MISO_GPIO_PORT, &port);  
    GPIO_PinAFConfig(RFID_MISO_GPIO_PORT, RFID_MISO_SOURCE, RFID_MISO_AF);    

    // MOSI
    port.GPIO_Pin =  RFID_MOSI_PIN;
    GPIO_Init(RFID_MOSI_GPIO_PORT, &port);
    GPIO_PinAFConfig(RFID_MOSI_GPIO_PORT, RFID_MOSI_SOURCE, RFID_MOSI_AF);
    
    // NSS
    port.GPIO_Pin =  RFID_NSS_PIN;
    port.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_Init(RFID_NSS_GPIO_PORT, &port);
    //GPIO_PinAFConfig(RFID_NSS_GPIO_PORT, RFID_NSS_SOURCE, RFID_NSS_AF);    

    GPIO_SetBits(RFID_NSS_GPIO_PORT, RFID_NSS_PIN);

    
    // SPI
    SPI_I2S_DeInit(RFID_SPI);

    SPI_InitTypeDef spi;
    spi.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
    spi.SPI_Mode = SPI_Mode_Master;
    spi.SPI_DataSize = SPI_DataSize_8b;
    spi.SPI_CPOL = SPI_CPOL_Low;
    spi.SPI_CPHA = SPI_CPHA_1Edge;
    spi.SPI_NSS = SPI_NSS_Soft;
    spi.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_16;
    spi.SPI_FirstBit = SPI_FirstBit_MSB;
    spi.SPI_CRCPolynomial = 7;
    SPI_Init(RFID_SPI, &spi);
    
    SPI_Cmd(RFID_SPI, ENABLE);
}

uint8_t PCD_WriteAndReadSPI(uint8_t data)
{
    while (SPI_I2S_GetFlagStatus(RFID_SPI, SPI_I2S_FLAG_TXE) == RESET) { }

    SPI_I2S_SendData(RFID_SPI, data);    

    while (SPI_I2S_GetFlagStatus(RFID_SPI, SPI_I2S_FLAG_RXNE) == RESET) { }
    
    return (uint8_t) SPI_I2S_ReceiveData(RFID_SPI);
}

void PCD_WriteRegister(uint8_t reg, uint8_t value)
{
    GPIO_ResetBits(RFID_NSS_GPIO_PORT, RFID_NSS_PIN);
    
    PCD_WriteAndReadSPI(reg & 0x7E);
    PCD_WriteAndReadSPI(value);

    GPIO_SetBits(RFID_NSS_GPIO_PORT, RFID_NSS_PIN);
}

void PCD_WriteBuffer(uint8_t reg, uint8_t count, uint8_t *values)
{
    GPIO_ResetBits(RFID_NSS_GPIO_PORT, RFID_NSS_PIN);

    // MSB == 0 is for writing. LSB is not used in address. Datasheet section 8.1.2.3.
    PCD_WriteAndReadSPI(reg & 0x7E);
    
    for (uint8_t index = 0; index < count; index++)
    {
        PCD_WriteAndReadSPI(values[index]);
    }

    GPIO_SetBits(RFID_NSS_GPIO_PORT, RFID_NSS_PIN);
}

uint8_t PCD_ReadRegister(uint8_t reg)
{
    GPIO_ResetBits(RFID_NSS_GPIO_PORT, RFID_NSS_PIN);
    
    PCD_WriteAndReadSPI(reg | 0x80);
    
    uint8_t result = PCD_WriteAndReadSPI(0);

    GPIO_SetBits(RFID_NSS_GPIO_PORT, RFID_NSS_PIN);
    
    return result;
}

void PCD_ReadBuffer(uint8_t reg, uint8_t count, uint8_t *values, uint8_t rxAlign)
{
    if (!count) 
        return;

    uint8_t address = 0x80 | reg;  // MSB == 1 is for reading. LSB is not used in address. Datasheet section 8.1.2.3.
    uint8_t index = 0;             // Index in values array.

    GPIO_ResetBits(RFID_NSS_GPIO_PORT, RFID_NSS_PIN);
    
    count--;                       // One read is performed outside of the loop
    
    PCD_WriteAndReadSPI(address);  // Tell MFRC522 which address we want to read

    while (index < count)
    {
        if ((index == 0) && rxAlign) // Only update bit positions rxAlign..7 in values[0]
        {
            // Create bit mask for bit positions rxAlign..7
            uint8_t mask = 0;
            
            for (uint8_t i = rxAlign; i <= 7; i++)
            {
                mask |= (1 << i);
            }

            // Read value and tell that we want to read the same address again.
            uint8_t value = PCD_WriteAndReadSPI(address);

            // Apply mask to both current value of values[0] and the new data in value.
            values[0] = (values[index] & ~mask) | (value & mask);
        }
        else
        {
            // Read value and tell that we want to read the same address again.
            values[index] = PCD_WriteAndReadSPI(address);
        }

        index++;
    }

    values[index] = PCD_WriteAndReadSPI(0); // Read the final byte. Send 0 to stop reading.

    GPIO_SetBits(RFID_NSS_GPIO_PORT, RFID_NSS_PIN);
}

void PCD_SetRegisterBits(uint8_t reg, uint8_t mask)
{
    uint8_t tmp = PCD_ReadRegister(reg);
    
