vdm-dev/stm32playground/Projects_F407/Rfid522/rfid.c
    PCD_WriteRegister(reg, tmp | mask);     // set bit mask
}

void PCD_ClrRegisterBits(uint8_t reg, uint8_t mask)
{
    uint8_t tmp = PCD_ReadRegister(reg);
    PCD_WriteRegister(reg, tmp & (~mask));    // clear bit mask
}

uint8_t PCD_CalculateCRC(uint8_t *data, uint8_t length, uint8_t *result)
{
    PCD_WriteRegister(CommandReg, PCD_Idle);      // Stop any active command.
    PCD_WriteRegister(DivIrqReg, 0x04);           // Clear the CRCIRq interrupt request bit
    PCD_SetRegisterBits(FIFOLevelReg, 0x80);      // FlushBuffer = 1, FIFO initialization
    PCD_WriteBuffer(FIFODataReg, length, data);   // Write data to the FIFO
    PCD_WriteRegister(CommandReg, PCD_CalcCRC);   // Start the calculation

    // Wait for the CRC calculation to complete. Each iteration of the while-loop takes 17.73us.
    uint16_t i = 5000;
    uint8_t n;
    
    while (1)
    {
        n = PCD_ReadRegister(DivIrqReg);  // DivIrqReg[7..0] bits are: Set2 reserved reserved MfinActIRq   reserved CRCIRq reserved reserved

        if (n & 0x04)
        {
            // CRCIRq bit set - calculation done
            break;
        }

        if (--i == 0)
        {
            // The emergency break. We will eventually terminate on this one after 89ms.
            // Communication with the MFRC522 might be down.
            return STATUS_TIMEOUT;
        }
    }

    // Stop calculating CRC for new content in the FIFO.
    PCD_WriteRegister(CommandReg, PCD_Idle);

    // Transfer the result from the registers to the result buffer
    result[0] = PCD_ReadRegister(CRCResultRegL);
    result[1] = PCD_ReadRegister(CRCResultRegH);

    return STATUS_OK;
}

void PCD_Init(void)
{
    /* Reset MFRC522 */
    // TODO:
    //m_RESET = 0;
    //wait_ms(10);
    //m_RESET = 1;

    // Section 8.8.2 in the datasheet says the oscillator start-up time is the start up time of the crystal + 37,74us. Let us be generous: 50ms.
    //wait_ms(50);

    // When communicating with a PICC we need a timeout if something goes wrong.
    // f_timer = 13.56 MHz / (2*TPreScaler+1) where TPreScaler = [TPrescaler_Hi:TPrescaler_Lo].
    // TPrescaler_Hi are the four low bits in TModeReg. TPrescaler_Lo is TPrescalerReg.
    PCD_WriteRegister(TModeReg, 0x80);      // TAuto=1; timer starts automatically at the end of the transmission in all communication modes at all speeds
    PCD_WriteRegister(TPrescalerReg, 0xA9); // TPreScaler = TModeReg[3..0]:TPrescalerReg, ie 0x0A9 = 169 => f_timer=40kHz, ie a timer period of 25us.
    PCD_WriteRegister(TReloadRegH, 0x03);   // Reload timer with 0x3E8 = 1000, ie 25ms before timeout.
    PCD_WriteRegister(TReloadRegL, 0xE8);

    PCD_WriteRegister(TxASKReg, 0x40);      // Default 0x00. Force a 100 % ASK modulation independent of the ModGsPReg register setting
    PCD_WriteRegister(ModeReg, 0x3D);       // Default 0x3F. Set the preset value for the CRC coprocessor for the CalcCRC command to 0x6363 (ISO 14443-3 part 6.2.4)

    PCD_WriteRegister(RFCfgReg, (0x07<<4)); // Set Rx Gain to max

    PCD_AntennaOn();                        // Enable the antenna driver pins TX1 and TX2 (they were disabled by the reset)
}

void PCD_Reset(void)
{
    PCD_WriteRegister(CommandReg, PCD_SoftReset); // Issue the SoftReset command.
    // The datasheet does not mention how long the SoftRest command takes to complete.
    // But the MFRC522 might have been in soft power-down mode (triggered by bit 4 of CommandReg)
    // Section 8.8.2 in the datasheet says the oscillator start-up time is the start up time of the crystal + 37,74us. Let us be generous: 50ms.
    //wait_ms(50);

    // Wait for the PowerDown bit in CommandReg to be cleared
    while (PCD_ReadRegister(CommandReg) & (1<<4))
    {
        // PCD still restarting - unlikely after waiting 50ms, but better safe than sorry.
    }
}

void PCD_AntennaOn(void)
{
    uint8_t value = PCD_ReadRegister(TxControlReg);
    
    if ((value & 0x03) != 0x03)
        PCD_WriteRegister(TxControlReg, value | 0x03);
}

uint8_t PCD_TransceiveData(uint8_t *sendData,
                           uint8_t sendLen,
                           uint8_t *backData,
                           uint8_t *backLen,
                           uint8_t *validBits,
                           uint8_t rxAlign,
                           uint8_t checkCRC)
{
    uint8_t waitIRq = 0x30;    // RxIRq and IdleIRq

    return PCD_CommunicateWithPICC(PCD_Transceive, waitIRq, sendData, sendLen, backData, backLen, validBits, rxAlign, checkCRC);
}

uint8_t PCD_CommunicateWithPICC(uint8_t command,
                                uint8_t waitIRq,
                                uint8_t *sendData,
                                uint8_t sendLen,
                                uint8_t *backData,
                                uint8_t *backLen,
                                uint8_t *validBits,
                                uint8_t rxAlign,
                                uint8_t checkCRC)
{
    uint8_t n, _validBits = 0;
    uint32_t i;

    // Prepare values for BitFramingReg
    uint8_t txLastBits = validBits ? *validBits : 0;
    uint8_t bitFraming = (rxAlign << 4) + txLastBits;   // RxAlign = BitFramingReg[6..4]. TxLastBits = BitFramingReg[2..0]

    PCD_WriteRegister(CommandReg, PCD_Idle);            // Stop any active command.
    PCD_WriteRegister(ComIrqReg, 0x7F);                 // Clear all seven interrupt request bits
    PCD_SetRegisterBits(FIFOLevelReg, 0x80);            // FlushBuffer = 1, FIFO initialization
    PCD_WriteBuffer(FIFODataReg, sendLen, sendData);    // Write sendData to the FIFO
    PCD_WriteRegister(BitFramingReg, bitFraming);       // Bit adjustments
    PCD_WriteRegister(CommandReg, command);             // Execute the command

    if (command == PCD_Transceive)
        PCD_SetRegisterBits(BitFramingReg, 0x80);       // StartSend=1, transmission of data starts

    // Wait for the command to complete.
    // In PCD_Init() we set the TAuto flag in TModeReg. This means the timer automatically starts when the PCD stops transmitting.
    // Each iteration of the do-while-loop takes 17.86us.
    i = 2000;
    while (1)
    {
        n = PCD_ReadRegister(ComIrqReg);  // ComIrqReg[7..0] bits are: Set1 TxIRq RxIRq IdleIRq   HiAlertIRq LoAlertIRq ErrIRq TimerIRq

        if (n & waitIRq)
        {          // One of the interrupts that signal success has been set.
            break;
        }

