vdm-dev/stm32playground/Projects_F407/Rfid522/rfid.c
        if (n & 0x01)
        {           // Timer interrupt - nothing received in 25ms
            return STATUS_TIMEOUT;
        }

        if (--i == 0)
        {           // The emergency break. If all other condions fail we will eventually terminate on this one after 35.7ms. Communication with the MFRC522 might be down.
            return STATUS_TIMEOUT;
        }
    }

    // Stop now if any errors except collisions were detected.
    uint8_t errorRegValue = PCD_ReadRegister(ErrorReg); // ErrorReg[7..0] bits are: WrErr TempErr reserved BufferOvfl   CollErr CRCErr ParityErr ProtocolErr
    
    if (errorRegValue & 0x13)
    {  // BufferOvfl ParityErr ProtocolErr
        return STATUS_ERROR;
    }

    // If the caller wants data back, get it from the MFRC522.
    if (backData && backLen)
    {
        n = PCD_ReadRegister(FIFOLevelReg);           // Number of bytes in the FIFO
        
        if (n > *backLen)
        {
            return STATUS_NO_ROOM;
        }

        *backLen = n;                       // Number of bytes returned
        
        PCD_ReadBuffer(FIFODataReg, n, backData, rxAlign);    // Get received data from FIFO
        
        _validBits = PCD_ReadRegister(ControlReg) & 0x07; // RxLastBits[2:0] indicates the number of valid bits in the last received byte. If this value is 000b, the whole byte is valid.
        
        if (validBits)
        {
            *validBits = _validBits;
        }
    }

    // Tell about collisions
    if (errorRegValue & 0x08)
    { // CollErr
        return STATUS_COLLISION;
    }

    // Perform CRC_A validation if requested.
    if (backData && backLen && checkCRC)
    {
        // In this case a MIFARE Classic NAK is not OK.
        if ((*backLen == 1) && (_validBits == 4))
        {
            return STATUS_MIFARE_NACK;
        }

        // We need at least the CRC_A value and all 8 bits of the last byte must be received.
        if ((*backLen < 2) || (_validBits != 0))
        {
            return STATUS_CRC_WRONG;
        }

        // Verify CRC_A - do our own calculation and store the control in controlBuffer.
        uint8_t controlBuffer[2];
        
        n = PCD_CalculateCRC(&backData[0], *backLen - 2, &controlBuffer[0]);
        
        if (n != STATUS_OK)
        {
            return n;
        }

        if ((backData[*backLen - 2] != controlBuffer[0]) || (backData[*backLen - 1] != controlBuffer[1]))
        {
            return STATUS_CRC_WRONG;
        }
    }

    return STATUS_OK;
}

uint8_t PICC_REQA_or_WUPA(uint8_t command, uint8_t *bufferATQA, uint8_t *bufferSize)
{
    uint8_t validBits;
    uint8_t status;

    if (bufferATQA == 0 || *bufferSize < 2)
    {  // The ATQA response is 2 bytes long.
        return STATUS_NO_ROOM;
    }

    // ValuesAfterColl=1 => Bits received after collision are cleared.
    PCD_ClrRegisterBits(CollReg, 0x80);

    // For REQA and WUPA we need the short frame format
    // - transmit only 7 bits of the last (and only) byte. TxLastBits = BitFramingReg[2..0]
    validBits = 7;

    status = PCD_TransceiveData(&command, 1, bufferATQA, bufferSize, &validBits, 0, 0);
    
    if (status != STATUS_OK)
    {
        return status;
    }

    if ((*bufferSize != 2) || (validBits != 0))
    {   // ATQA must be exactly 16 bits.
        return STATUS_ERROR;
    }

    return STATUS_OK;
}

uint8_t PICC_RequestA(uint8_t *bufferATQA, uint8_t *bufferSize)
{
    return PICC_REQA_or_WUPA(PICC_CMD_REQA, bufferATQA, bufferSize);
}

uint8_t PICC_WakeupA(uint8_t *bufferATQA, uint8_t *bufferSize)
{
  return PICC_REQA_or_WUPA(PICC_CMD_WUPA, bufferATQA, bufferSize);
}

uint8_t PICC_Select(Uid *uid, uint8_t validBits)
{
    uint8_t uidComplete;
    uint8_t selectDone;
    uint8_t useCascadeTag;
    uint8_t cascadeLevel = 1;
    uint8_t result;
    uint8_t count;
    uint8_t index;
    uint8_t uidIndex;          // The first index in uid->uidByte[] that is used in the current Cascade Level.
    uint8_t currentLevelKnownBits;   // The number of known UID bits in the current Cascade Level.
    uint8_t buffer[9];         // The SELECT/ANTICOLLISION commands uses a 7 byte standard frame + 2 bytes CRC_A
    uint8_t bufferUsed;        // The number of bytes used in the buffer, ie the number of bytes to transfer to the FIFO.
    uint8_t rxAlign;           // Used in BitFramingReg. Defines the bit position for the first bit received.
    uint8_t txLastBits;        // Used in BitFramingReg. The number of valid bits in the last transmitted byte.
    uint8_t *responseBuffer;
    uint8_t responseLength;

    // Description of buffer structure:
    //    Byte 0: SEL         Indicates the Cascade Level: PICC_CMD_SEL_CL1, PICC_CMD_SEL_CL2 or PICC_CMD_SEL_CL3
    //    Byte 1: NVB         Number of Valid Bits (in complete command, not just the UID): High nibble: complete bytes, Low nibble: Extra bits.
    //    Byte 2: UID-data or CT    See explanation below. CT means Cascade Tag.
    //    Byte 3: UID-data
    //    Byte 4: UID-data
    //    Byte 5: UID-data
    //    Byte 6: BCC         Block Check Character - XOR of bytes 2-5
    //    Byte 7: CRC_A
    //    Byte 8: CRC_A
    // The BCC and CRC_A is only transmitted if we know all the UID bits of the current Cascade Level.
    //
    // Description of bytes 2-5: (Section 6.5.4 of the ISO/IEC 14443-3 draft: UID contents and cascade levels)
    //    UID size  Cascade level Byte2 Byte3 Byte4 Byte5
    //    ========  ============= ===== ===== ===== =====
    //     4 bytes    1     uid0  uid1  uid2  uid3
    //     7 bytes    1     CT    uid0  uid1  uid2
    //                2     uid3  uid4  uid5  uid6
    //    10 bytes    1     CT    uid0  uid1  uid2
    //                2     CT    uid3  uid4  uid5
    //                3     uid6  uid7  uid8  uid9

    // Sanity checks
    if (validBits > 80)
    {
        return STATUS_INVALID;
    }

    // Prepare MFRC522
    // ValuesAfterColl=1 => Bits received after collision are cleared.
    PCD_ClrRegisterBits(CollReg, 0x80);

