vdm-dev/stm32playground/Projects_F407/Rfid522/rfid.c
        if ((buffer[2] != responseBuffer[1]) || (buffer[3] != responseBuffer[2]))
        {
            return STATUS_CRC_WRONG;
        }

        if (responseBuffer[0] & 0x04)
        { // Cascade bit set - UID not complete yes
            cascadeLevel++;
        }
        else
        {
            uidComplete = 1;
            uid->sak = responseBuffer[0];
        }
    } // End of while ( ! uidComplete)

    // Set correct uid->size
    uid->size = 3 * cascadeLevel + 1;

    return STATUS_OK;
}

uint8_t PICC_HaltA(void)
{
    uint8_t result;
    uint8_t buffer[4];

    // Build command buffer
    buffer[0] = PICC_CMD_HLTA;
    buffer[1] = 0;

    // Calculate CRC_A
    result = PCD_CalculateCRC(buffer, 2, &buffer[2]);
    if (result == STATUS_OK)
    {
        // Send the command.
        // The standard says:
        //    If the PICC responds with any modulation during a period of 1 ms after the end of the frame containing the
        //    HLTA command, this response shall be interpreted as 'not acknowledge'.
        // We interpret that this way: Only STATUS_TIMEOUT is an success.
        result = PCD_TransceiveData(buffer, sizeof(buffer), 0, 0, 0, 0, 0);
        if (result == STATUS_TIMEOUT)
        {
            result = STATUS_OK;
        }
        else if (result == STATUS_OK)
        { // That is ironically NOT ok in this case ;-)
            result = STATUS_ERROR;
        }
    }

    return result;
}

uint8_t PCD_Authenticate(uint8_t command, uint8_t blockAddr, MIFARE_Key *key, Uid *uid)
{
    uint8_t i, waitIRq = 0x10;    // IdleIRq

    // Build command buffer
    uint8_t sendData[12];
    sendData[0] = command;
    sendData[1] = blockAddr;

    for (i = 0; i < MF_KEY_SIZE; i++)
    {  // 6 key bytes
        sendData[2+i] = key->keyByte[i];
    }

    for (i = 0; i < 4; i++)
    { // The first 4 bytes of the UID
        sendData[8+i] = uid->uidByte[i];
    }

    // Start the authentication.
    return PCD_CommunicateWithPICC(PCD_MFAuthent, waitIRq, &sendData[0], sizeof(sendData), 0, 0, 0, 0, 0);
}

void PCD_StopCrypto1(void)
{
    // Clear MFCrypto1On bit
    PCD_ClrRegisterBits(Status2Reg, 0x08); // Status2Reg[7..0] bits are: TempSensClear I2CForceHS reserved reserved   MFCrypto1On ModemState[2:0]
}

uint8_t MIFARE_Read(uint8_t blockAddr, uint8_t *buffer, uint8_t *bufferSize)
{
    uint8_t result = STATUS_NO_ROOM;

    // Sanity check
    if ((buffer == 0) || (*bufferSize < 18))
    {
        return result;
    }

    // Build command buffer
    buffer[0] = PICC_CMD_MF_READ;
    buffer[1] = blockAddr;

    // Calculate CRC_A
    result = PCD_CalculateCRC(buffer, 2, &buffer[2]);
    if (result != STATUS_OK)
    {
        return result;
    }

    // Transmit the buffer and receive the response, validate CRC_A.
    return PCD_TransceiveData(buffer, 4, buffer, bufferSize, 0, 0, 1);
}

uint8_t MIFARE_Write(uint8_t blockAddr, uint8_t *buffer, uint8_t bufferSize)
{
    uint8_t result;

    // Sanity check
    if (buffer == 0 || bufferSize < 16)
    {
        return STATUS_INVALID;
    }

    // Mifare Classic protocol requires two communications to perform a write.
    // Step 1: Tell the PICC we want to write to block blockAddr.
    uint8_t cmdBuffer[2];
    cmdBuffer[0] = PICC_CMD_MF_WRITE;
    cmdBuffer[1] = blockAddr;
    // Adds CRC_A and checks that the response is MF_ACK.
    result = PCD_MIFARE_Transceive(cmdBuffer, 2, 0);
    if (result != STATUS_OK)
    {
        return result;
    }

    // Step 2: Transfer the data
    // Adds CRC_A and checks that the response is MF_ACK.
    result = PCD_MIFARE_Transceive(buffer, bufferSize, 0);
    if (result != STATUS_OK)
    {
        return result;
    }

    return STATUS_OK;
}

uint8_t MIFARE_UltralightWrite(uint8_t page, uint8_t *buffer, uint8_t bufferSize)
{
    uint8_t result;

    // Sanity check
    if (buffer == NULL || bufferSize < 4)
    {
        return STATUS_INVALID;
    }

    // Build commmand buffer
    uint8_t cmdBuffer[6];
    cmdBuffer[0] = PICC_CMD_UL_WRITE;
    cmdBuffer[1] = page;
    memcpy(&cmdBuffer[2], buffer, 4);

    // Perform the write
    result = PCD_MIFARE_Transceive(cmdBuffer, 6, 0); // Adds CRC_A and checks that the response is MF_ACK.
    if (result != STATUS_OK)
    {
        return result;
    }

    return STATUS_OK;
}

uint8_t MIFARE_TwoStepHelper(uint8_t command, uint8_t blockAddr, uint32_t data)
{
    uint8_t result;
    uint8_t cmdBuffer[2]; // We only need room for 2 bytes.

    // Step 1: Tell the PICC the command and block address
    cmdBuffer[0] = command;
    cmdBuffer[1] = blockAddr;

    // Adds CRC_A and checks that the response is MF_ACK.
    result = PCD_MIFARE_Transceive(cmdBuffer, 2, 0);
    if (result != STATUS_OK)
    {
    return result;
    }

    // Step 2: Transfer the data
    // Adds CRC_A and accept timeout as success.
    result = PCD_MIFARE_Transceive((uint8_t *) &data, 4, 1);
    if (result != STATUS_OK)
    {
    return result;
    }

    return STATUS_OK;
}

uint8_t MIFARE_Decrement(uint8_t blockAddr, uint32_t delta)
{
    return MIFARE_TwoStepHelper(PICC_CMD_MF_DECREMENT, blockAddr, delta);
}

uint8_t MIFARE_Increment(uint8_t blockAddr, uint32_t delta)
{
    return MIFARE_TwoStepHelper(PICC_CMD_MF_INCREMENT, blockAddr, delta);
}

uint8_t MIFARE_Restore(uint8_t blockAddr)
{
    // The datasheet describes Restore as a two step operation, but does not explain what data to transfer in step 2.
    // Doing only a single step does not work, so I chose to transfer 0L in step two.
    return MIFARE_TwoStepHelper(PICC_CMD_MF_RESTORE, blockAddr, 0L);
}

uint8_t MIFARE_Transfer(uint8_t blockAddr)
{
    uint8_t cmdBuffer[2]; // We only need room for 2 bytes.

    // Tell the PICC we want to transfer the result into block blockAddr.
    cmdBuffer[0] = PICC_CMD_MF_TRANSFER;
    cmdBuffer[1] = blockAddr;

    // Adds CRC_A and checks that the response is MF_ACK.
    return PCD_MIFARE_Transceive(cmdBuffer, 2, 0);
}

uint8_t PCD_MIFARE_Transceive(uint8_t *sendData, uint8_t sendLen, uint8_t acceptTimeout)
{
    uint8_t result;
    uint8_t cmdBuffer[18]; // We need room for 16 bytes data and 2 bytes CRC_A.

    // Sanity check
    if (sendData == NULL || sendLen > 16)
    {
        return STATUS_INVALID;
    }

    // Copy sendData[] to cmdBuffer[] and add CRC_A
    memcpy(cmdBuffer, sendData, sendLen);
    result = PCD_CalculateCRC(cmdBuffer, sendLen, &cmdBuffer[sendLen]);
    if (result != STATUS_OK)
    {
        return result;
    }

    sendLen += 2;

    // Transceive the data, store the reply in cmdBuffer[]
    uint8_t waitIRq = 0x30;    // RxIRq and IdleIRq
    uint8_t cmdBufferSize = sizeof(cmdBuffer);
    uint8_t validBits = 0;
    result = PCD_CommunicateWithPICC(PCD_Transceive, waitIRq, cmdBuffer, sendLen, cmdBuffer, &cmdBufferSize, &validBits, 0, 0);
    if (acceptTimeout && result == STATUS_TIMEOUT)
    {
        return STATUS_OK;
    }

    if (result != STATUS_OK)
    {
        return result;
    }

    // The PICC must reply with a 4 bit ACK
    if (cmdBufferSize != 1 || validBits != 4)
    {
        return STATUS_ERROR;
    }

