vdm-dev/stm32playground/Projects_F407/Rfid522/rfid.c
    if (cmdBuffer[0] != MF_ACK)
    {
        return STATUS_MIFARE_NACK;
    }

    return STATUS_OK;
}

uint8_t PICC_GetType(uint8_t sak)
{
    uint8_t retType = PICC_TYPE_UNKNOWN;

    if (sak & 0x04)
    { // UID not complete
        retType = PICC_TYPE_NOT_COMPLETE;
    }
    else
    {
        switch (sak)
        {
        case 0x09: retType = PICC_TYPE_MIFARE_MINI; break;
        case 0x08: retType = PICC_TYPE_MIFARE_1K;   break;
        case 0x18: retType = PICC_TYPE_MIFARE_4K;   break;
        case 0x00: retType = PICC_TYPE_MIFARE_UL;   break;
        case 0x10:
        case 0x11: retType = PICC_TYPE_MIFARE_PLUS; break;
        case 0x01: retType = PICC_TYPE_TNP3XXX;     break;
        default:
            if (sak & 0x20)
            {
                retType = PICC_TYPE_ISO_14443_4;
            }
            else if (sak & 0x40)
            {
                retType = PICC_TYPE_ISO_18092;
            }
            break;
        }
    }

    return retType;
}

char* PICC_GetTypeName(uint8_t piccType)
{
    if(piccType == PICC_TYPE_NOT_COMPLETE)
    {
        piccType = MFRC522_MaxPICCs - 1;
    }

    return((char *) _TypeNamePICC[piccType]);
}

char* GetStatusCodeName(uint8_t code)
{
    return ((char *) _ErrorMessage[code]);
}

void MIFARE_SetAccessBits(uint8_t *accessBitBuffer,  
                          uint8_t g0,                
                          uint8_t g1,                
                          uint8_t g2,                
                          uint8_t g3)
{
    uint8_t c1 = ((g3 & 4) << 1) | ((g2 & 4) << 0) | ((g1 & 4) >> 1) | ((g0 & 4) >> 2);
    uint8_t c2 = ((g3 & 2) << 2) | ((g2 & 2) << 1) | ((g1 & 2) << 0) | ((g0 & 2) >> 1);
    uint8_t c3 = ((g3 & 1) << 3) | ((g2 & 1) << 2) | ((g1 & 1) << 1) | ((g0 & 1) << 0);

    accessBitBuffer[0] = (~c2 & 0xF) << 4 | (~c1 & 0xF);
    accessBitBuffer[1] =          c1 << 4 | (~c3 & 0xF);
    accessBitBuffer[2] =          c3 << 4 | c2;
}

uint8_t PICC_IsNewCardPresent(void)
{
    uint8_t bufferATQA[2];
    uint8_t bufferSize = sizeof(bufferATQA);
    uint8_t result = PICC_RequestA(bufferATQA, &bufferSize);
    return ((result == STATUS_OK) || (result == STATUS_COLLISION));
}
